blogsrc/spring-howto.org
#+TITLE: Spring Web Develop HOWTO
#+SETUPFILE: ../setup/theme-readtheorg-local.setup

* 前言
2015年10月以前，我做c，c++，perl，lua开发，一直崇尚简洁。虽然很早就读过 thinking in java，但是一直没有涉足java开发，java给我两个感觉，一是笨重，而是庞杂，这里面有各种框架的功劳，看到诸多形形色色的框架，就不寒而栗。

2015年10月以后，终于不得不接触java开发，首当其冲的就是spring。一开始就被各种概念整懵了，IOC，DI，AOP，完全搞不懂这些东西是干啥的，也不知道引入它们的目的。徘徊了一个月，终于恍然大悟，spring其实很简单，如果有人点拨，学习spring的过程不至于这么曲折。随后，面试了一些java开发者，发现大家都知道spring，但是对spring的理解和使用都比较肤浅。本文试图由浅入深的讲解spring的本质是啥，如何最大限度的利用spring。

本文基于Spring4，主要讲解Rest风格的编程，不涉及到View部分。本文也不求面面俱到，只求领人入门，有更复杂的需求，尽可以翻看文档，Spring不会让你失望，只有想不到，没有做不到。

* Spring 解决什么问题

** 框架的作用
框架五花八门，无处不在，框架解决的问题各式各样，但从编程实践的角度来看，框架是为了让程序更优雅。

*** 框架消除重复代码

*** 框架消除相似代码

框架是一种抽象，抽象层次越高，上述好处越多，当然，可能相应的灵活性就少很多。

** 程序是什么
这个问题似乎太简单，但一时又不知从何说起。先看个简单的程序，hello.pl
#+BEGIN_SRC perl :results output
#!/usr/bin/perl
my $name = shift || "friend s";
print "hello $name\n";
#+END_SRC

#+BEGIN_SRC sh
  $ ./hello.pl spring
  hello spring
#+END_SRC

这个程序异常简单，它接受字符串，输出字符串。那么复杂的程序呢？我们考虑http服务器，比如jetty，它的输入输出是什么？

#+BEGIN_EXAMPLE
# curl http://dev/api/login?jsonp=x -vv
> GET /api/login?jsonp=x HTTP/1.1
> User-Agent: curl/7.41.0
> Host: dev
> Accept: */*
>
< HTTP/1.1 200 OK
< Server: nginx/1.8.0
< Date: Thu, 31 Dec 2015 02:43:19 GMT
< Content-Type: application/javascript
< Transfer-Encoding: chunked
< Connection: keep-alive
< X-Content-Type-Options: nosniff
< X-XSS-Protection: 1; mode=block
< Cache-Control: no-cache, no-store, max-age=0, must-revalidate
< Pragma: no-cache
< Expires: 0
< X-Frame-Options: DENY
<
/**/x({"code":400,"message":"bad request","data":{"password":"password is required"}});
#+END_EXAMPLE

这里我们用curl模拟http请求， ~输入点~ 包括
- HTTP Method，这里是 ~GET~ ，此外常用的还有 ~POST PUT DELETE~
- 请求 ~url~ ，包括 ~path~ 这里是 ~/api/login~ ，和 ~querystring~ ，这里是 ~jsonp=x~ , ~querystring~ 是可选的
- 请求 ~header~ ，例如 Host，Accept，有些header比其它header要重要一些，比如cookie。
- 请求 ~body~ ，这里body为空，一般请求 ~POST PUT~ 才需要body。

~输出点~ 包括：
- HTTP code，这里是 ~200~。
- 响应 ~header~ ，例如 Content-Type
- 响应 ~body~ ，这里是 /**/开头的行

上面的 ~输入~ 通过 ~tcp~ 协议传送给jetty，jetty通过 ~tcp~ 协议将 ~输出~ 回传给用户。这里针对输入和输出的规定，构成了 ~http~ 协议的内容， ~http~ 协议并没有规定输出 ~body~ 的格式。

从简单的 HelloWorld，到复杂的Web应用，程序的功能，无非都是解析输入，产生输出。程序使用程序语言编写的，程序语言规定了数据类型（结构），程序中的逻辑都是通过操作程序支持的数据类型实现的。我们需要在程序开始时，把输入转成程序语言支持的数据类型，在程序结束时，把程序语言支持的数据类型转成响应的输出。

对 HelloWorld 而言， ~输入点~ 很简单，是一个命令行参数，对Web应用而言， ~输入点~ 就复杂很多，如何把 ~输入点~ 的数据转成编程语言支持的数据类型，正是框架做的事情。

除了数据转换，框架还提供了机制，可以校验数据有效性。

** 程序

* Spring 如何抽象输入和输出

** 基于原生的Servlet如何编程
Servlet是一套标准，java开发者可以使用它开发WEB应用，运行Servlet的web服务器称为Servlet容器，常见的Servlet容器有jetty，tomcat等。

#+BEGIN_SRC java
import java.io.*;
import javax.servlet.*;
import javax.servlet.http.*;

public class HelloWorld extends HttpServlet 
{
  public void doGet(HttpServletRequest request,
                    HttpServletResponse response)
            throws ServletException, IOException {
    String name = request.getParameter("name");
    response.setContentType("text/html");

    // Actual logic goes here.
    PrintWriter out = response.getWriter();
    out.println("<h1> Hello " + name + "</h1>");
  }
}
#+END_SRC

除了上述函数，我们还需要在 web.xml 配置url和处理函数的对应关系
#+BEGIN_SRC xml
<servlet>
   <servlet-name>HelloWorld</servlet-name>
   <servlet-class>HelloWorld</servlet-class>
</servlet>

<servlet-mapping>
   <servlet-name>HelloWorld</servlet-name>
   <url-pattern>/HelloWorld</url-pattern>
</servlet-mapping>
#+END_SRC

这个过程非常直观，Servlet容器收到WEB请求，根据url和web.xml的配置，选择相应的处理类处理。使用 ~HttpServletRequest HttpServletResponse~ 表示输入和输出，这个抽象层次太低了，本例中为了获取 ~querystring~ 中的name参数，需要调用相应的函数。如果可以直接把 ~querystring~ 中的name参数绑定到一个 *String类型的变量* 抽象层次就高很多。

另外url和url处理类在不同的地方，不能一眼看出url的处理逻辑。

