blogs/spring-howto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Spring Web Develop HOWTO</title>
<!-- 2016-01-20 三 19:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Spring Web Develop HOWTO</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 前言</a></li>
<li><a href="#sec-2">2. Spring 解决什么问题</a>
<ul>
<li><a href="#sec-2-1">2.1. 框架的作用</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. 框架消除重复代码</a></li>
<li><a href="#sec-2-1-2">2.1.2. 框架消除相似代码</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. 程序是什么</a></li>
<li><a href="#sec-2-3">2.3. 程序</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Spring 如何抽象输入和输出</a>
<ul>
<li><a href="#sec-3-1">3.1. 基于原生的Servlet如何编程</a></li>
<li><a href="#sec-3-2">3.2. Spring 对输入的抽象</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. RestController</a></li>
<li><a href="#sec-3-2-2">3.2.2. RequestMapping</a></li>
<li><a href="#sec-3-2-3">3.2.3. PathVariable</a></li>
<li><a href="#sec-3-2-4">3.2.4. ReqestParam</a></li>
<li><a href="#sec-3-2-5">3.2.5. CookieValue 和 RequestHeader</a></li>
<li><a href="#sec-3-2-6">3.2.6. MatrixVariable</a></li>
<li><a href="#sec-3-2-7">3.2.7. RequestBody</a></li>
<li><a href="#sec-3-2-8">3.2.8. 绑定到对象</a></li>
<li><a href="#sec-3-2-9">3.2.9. 参数校验</a></li>
<li><a href="#sec-3-2-10">3.2.10. 原生态的输入</a></li>
<li><a href="#sec-3-2-11">3.2.11. Spring 对 RestController 中函数原型的要求</a></li>
</ul>
</li>
<li><a href="#sec-3-3">3.3. Spring 对输出的抽象</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. 返回String</a></li>
<li><a href="#sec-3-3-2">3.3.2. 返回对象</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
2015年10月以前，我做c，c++，perl，lua开发，一直崇尚简洁。虽然很早就读过 thinking in java，但是一直没有涉足java开发，java给我两个感觉，一是笨重，而是庞杂，这里面有各种框架的功劳，看到诸多形形色色的框架，就不寒而栗。
</p>

<p>
2015年10月以后，终于不得不接触java开发，首当其冲的就是spring。一开始就被各种概念整懵了，IOC，DI，AOP，完全搞不懂这些东西是干啥的，也不知道引入它们的目的。徘徊了一个月，终于恍然大悟，spring其实很简单，如果有人点拨，学习spring的过程不至于这么曲折。随后，面试了一些java开发者，发现大家都知道spring，但是对spring的理解和使用都比较肤浅。本文试图由浅入深的讲解spring的本质是啥，如何最大限度的利用spring。
</p>

<p>
本文基于Spring4，主要讲解Rest风格的编程，不涉及到View部分。本文也不求面面俱到，只求领人入门，有更复杂的需求，尽可以翻看文档，Spring不会让你失望，只有想不到，没有做不到。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Spring 解决什么问题</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 框架的作用</h3>
<div class="outline-text-3" id="text-2-1">
<p>
框架五花八门，无处不在，框架解决的问题各式各样，但从编程实践的角度来看，框架是为了让程序更优雅。
</p>
</div>

<div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 框架消除重复代码</h4>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> 框架消除相似代码</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
框架是一种抽象，抽象层次越高，上述好处越多，当然，可能相应的灵活性就少很多。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 程序是什么</h3>
<div class="outline-text-3" id="text-2-2">
<p>
这个问题似乎太简单，但一时又不知从何说起。先看个简单的程序，hello.pl
</p>
<div class="org-src-container">

<pre class="src src-perl"><span style="color: #ffff00;">#</span><span style="color: #ffff00;">!/usr/bin/perl</span>
<span style="color: #00ffff; font-weight: bold;">my</span> <span style="color: #ffff00;">$name</span> = <span style="color: #ff83fa;">shift</span> || <span style="color: #00ff00;">"friend s"</span>;
<span style="color: #ff83fa;">print</span> <span style="color: #00ff00;">"hello $name\n"</span>;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">$ ./hello.pl spring
hello spring
</pre>
</div>

<p>
这个程序异常简单，它接受字符串，输出字符串。那么复杂的程序呢？我们考虑http服务器，比如jetty，它的输入输出是什么？
</p>

<pre class="example">
# curl http://dev/api/login?jsonp=x -vv
&gt; GET /api/login?jsonp=x HTTP/1.1
&gt; User-Agent: curl/7.41.0
&gt; Host: dev
&gt; Accept: */*
&gt;
&lt; HTTP/1.1 200 OK
&lt; Server: nginx/1.8.0
&lt; Date: Thu, 31 Dec 2015 02:43:19 GMT
&lt; Content-Type: application/javascript
&lt; Transfer-Encoding: chunked
&lt; Connection: keep-alive
&lt; X-Content-Type-Options: nosniff
&lt; X-XSS-Protection: 1; mode=block
&lt; Cache-Control: no-cache, no-store, max-age=0, must-revalidate
&lt; Pragma: no-cache
&lt; Expires: 0
&lt; X-Frame-Options: DENY
&lt;
/**/x({"code":400,"message":"bad request","data":{"password":"password is required"}});
</pre>

<p>
这里我们用curl模拟http请求， <code>输入点</code> 包括
</p>
<ul class="org-ul">
<li>HTTP Method，这里是 <code>GET</code> ，此外常用的还有 <code>POST PUT DELETE</code>
</li>
<li>请求 <code>url</code> ，包括 <code>path</code> 这里是 <code>/api/login</code> ，和 <code>querystring</code> ，这里是 <code>jsonp=x</code> , <code>querystring</code> 是可选的
</li>
<li>请求 <code>header</code> ，例如 Host，Accept，有些header比其它header要重要一些，比如cookie。
</li>
<li>请求 <code>body</code> ，这里body为空，一般请求 <code>POST PUT</code> 才需要body。
</li>
</ul>

<p>
<code>输出点</code> 包括：
</p>
<ul class="org-ul">
<li>HTTP code，这里是 ~200~。
</li>
<li>响应 <code>header</code> ，例如 Content-Type
</li>
<li>响应 <code>body</code> ，这里是 /**/开头的行
</li>
</ul>

<p>
上面的 <code>输入</code> 通过 <code>tcp</code> 协议传送给jetty，jetty通过 <code>tcp</code> 协议将 <code>输出</code> 回传给用户。这里针对输入和输出的规定，构成了 <code>http</code> 协议的内容， <code>http</code> 协议并没有规定输出 <code>body</code> 的格式。
</p>

<p>
从简单的 HelloWorld，到复杂的Web应用，程序的功能，无非都是解析输入，产生输出。程序使用程序语言编写的，程序语言规定了数据类型（结构），程序中的逻辑都是通过操作程序支持的数据类型实现的。我们需要在程序开始时，把输入转成程序语言支持的数据类型，在程序结束时，把程序语言支持的数据类型转成响应的输出。
</p>

<p>
对 HelloWorld 而言， <code>输入点</code> 很简单，是一个命令行参数，对Web应用而言， <code>输入点</code> 就复杂很多，如何把 <code>输入点</code> 的数据转成编程语言支持的数据类型，正是框架做的事情。
</p>

<p>
除了数据转换，框架还提供了机制，可以校验数据有效性。
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 程序</h3>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Spring 如何抽象输入和输出</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 基于原生的Servlet如何编程</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Servlet是一套标准，java开发者可以使用它开发WEB应用，运行Servlet的web服务器称为Servlet容器，常见的Servlet容器有jetty，tomcat等。
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff; font-weight: bold;">import</span> <span style="color: #ff00ff;">java</span>.<span style="color: #ff00ff;">io</span>.*;
<span style="color: #00ffff; font-weight: bold;">import</span> <span style="color: #ff00ff;">javax</span>.<span style="color: #ff00ff;">servlet</span>.*;
<span style="color: #00ffff; font-weight: bold;">import</span> <span style="color: #ff00ff;">javax</span>.<span style="color: #ff00ff;">servlet</span>.<span style="color: #ff00ff;">http</span>.*;

<span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">HelloWorld</span> <span style="color: #00ffff; font-weight: bold;">extends</span> <span style="color: #00ff00;">HttpServlet </span>
<span style="color: #00ff00;">{</span>
<span style="color: #00ff00;">  public void doGet(HttpServletRequest</span> <span style="color: #ffff00;">request</span>,
                    <span style="color: #00ff00;">HttpServletResponse</span> <span style="color: #ffff00;">response</span>)
            <span style="color: #00ffff; font-weight: bold;">throws</span> <span style="color: #00ff00;">ServletException</span>, <span style="color: #00ff00;">IOException</span> {
    <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">name</span> = request.getParameter(<span style="color: #00ff00;">"name"</span>);
    response.setContentType(<span style="color: #00ff00;">"text/html"</span>);

    <span style="color: #ffff00;">// </span><span style="color: #ffff00;">Actual logic goes here.</span>
    <span style="color: #00ff00;">PrintWriter</span> <span style="color: #ffff00;">out</span> = response.getWriter();
    out.println(<span style="color: #00ff00;">"&lt;h1&gt; Hello "</span> + name + <span style="color: #00ff00;">"&lt;/h1&gt;"</span>);
  }
}
</pre>
</div>

<p>
除了上述函数，我们还需要在 web.xml 配置url和处理函数的对应关系
</p>
<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #0000ff; font-weight: bold;">servlet</span>&gt;
   &lt;<span style="color: #0000ff; font-weight: bold;">servlet-name</span>&gt;HelloWorld&lt;/<span style="color: #0000ff; font-weight: bold;">servlet-name</span>&gt;
   &lt;<span style="color: #0000ff; font-weight: bold;">servlet-class</span>&gt;HelloWorld&lt;/<span style="color: #0000ff; font-weight: bold;">servlet-class</span>&gt;
&lt;/<span style="color: #0000ff; font-weight: bold;">servlet</span>&gt;

&lt;<span style="color: #0000ff; font-weight: bold;">servlet-mapping</span>&gt;
   &lt;<span style="color: #0000ff; font-weight: bold;">servlet-name</span>&gt;HelloWorld&lt;/<span style="color: #0000ff; font-weight: bold;">servlet-name</span>&gt;
   &lt;<span style="color: #0000ff; font-weight: bold;">url-pattern</span>&gt;/HelloWorld&lt;/<span style="color: #0000ff; font-weight: bold;">url-pattern</span>&gt;
&lt;/<span style="color: #0000ff; font-weight: bold;">servlet-mapping</span>&gt;
</pre>
</div>

<p>
这个过程非常直观，Servlet容器收到WEB请求，根据url和web.xml的配置，选择相应的处理类处理。使用 <code>HttpServletRequest HttpServletResponse</code> 表示输入和输出，这个抽象层次太低了，本例中为了获取 <code>querystring</code> 中的name参数，需要调用相应的函数。如果可以直接把 <code>querystring</code> 中的name参数绑定到一个 <b>String类型的变量</b> 抽象层次就高很多。
</p>

<p>
另外url和url处理类在不同的地方，不能一眼看出url的处理逻辑。
</p>
</div>
</div>
