blogs/spring-howto.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Spring 对输入的抽象</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Spring提供了非常简单的机制，将 <code>输入点</code> 的数据转成java支持的数据类型， <code>long String List class</code> 等。
</p>
<ul class="org-ul">
<li>通过 <code>RestController</code> 和 <code>RequestMapping</code> 将 url 映射到具体的处理函数
</li>
<li>通过 <code>PathVariable</code> 和 <code>RequestParam</code> 将url的内容和querystring映射到java变量
</li>
<li>把 querystring 映射成java对象
</li>
<li>通过 <code>RequestHeader</code> 把 <code>header</code> 的值映射为java变量
</li>
</ul>

<p>
此外可以组合使用上述方法。如下代码将详细讲述映射（绑定）是如何发生的。
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@RestController</span>
<span style="color: #ff00ff;">@RequestMapping</span>(<span style="color: #00ff00;">"/api"</span>)
<span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">EchoController</span> {

  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ffff; font-weight: bold;">static</span> <span style="color: #00ffff; font-weight: bold;">class</span> <span style="color: #00ff00;">Profile</span> {
    <span style="color: #ff00ff;">@NotBlank</span>(message = <span style="color: #00ff00;">"name is required"</span>)
    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">name</span>;

    <span style="color: #ff00ff;">@Pattern</span>(regexp = <span style="color: #00ff00;">"\\d{11,15}"</span>, message = <span style="color: #00ff00;">"phone is required"</span>)
    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">phone</span>;

    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">List</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">favoriteColor</span>;

    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">setName</span>(<span style="color: #00ff00;">String</span> <span style="color: #ffff00;">name</span>) {
      <span style="color: #00ffff; font-weight: bold;">this</span>.name = name;
    }
    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">setPhone</span>(<span style="color: #00ff00;">String</span> <span style="color: #ffff00;">phone</span>) {
      <span style="color: #00ffff; font-weight: bold;">this</span>.phone = phone;
    }
    <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">setFavoriteColor</span>(<span style="color: #00ff00;">List</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">color</span>) {
      <span style="color: #00ffff; font-weight: bold;">this</span>.favoriteColor = color;
    }
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">OptionalLong is not support now, use Optional&lt;Long&gt; instead of</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/power/5</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/power/5/3</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = {<span style="color: #00ff00;">"/power/{base}"</span>, <span style="color: #00ff00;">"/power/{base}/{power}"</span>}, method = <span style="color: #ff00ff;">RequestMethod</span>.GET)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">long</span> <span style="color: #0000ff; font-weight: bold;">getPower</span>(<span style="color: #ff00ff;">@PathVariable</span> <span style="color: #00ff00;">long</span> <span style="color: #ffff00;">base</span>, <span style="color: #ff00ff;">@PathVariable</span>(<span style="color: #00ff00;">"power"</span>) <span style="color: #00ff00;">Optional</span>&lt;<span style="color: #00ff00;">Long</span>&gt; <span style="color: #ffff00;">powerOpt</span>) {
    <span style="color: #00ff00;">long</span> <span style="color: #ffff00;">power</span> = powerOpt.orElse(2L);
    <span style="color: #00ffff; font-weight: bold;">return</span> (<span style="color: #00ff00;">long</span>) Math.pow(base, power);
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/upper/hello</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/upper?qs=world</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = {<span style="color: #00ff00;">"/upper"</span>, <span style="color: #00ff00;">"/upper/{upper}"</span>}, method = <span style="color: #ff00ff;">RequestMethod</span>.GET)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">String</span> <span style="color: #0000ff; font-weight: bold;">getUpper</span>(
    <span style="color: #ff00ff;">@PathVariable</span> <span style="color: #00ff00;">Optional</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">upper</span>,
    <span style="color: #ff00ff;">@RequestParam</span>(required = <span style="color: #ff00ff;">false</span>, defaultValue = <span style="color: #00ff00;">"Hello world"</span>) <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">qs</span>) {
    <span style="color: #00ffff; font-weight: bold;">if</span> (upper.isPresent()) <span style="color: #00ffff; font-weight: bold;">return</span> upper.get().toUpperCase();
    <span style="color: #00ffff; font-weight: bold;">return</span> qs.toUpperCase();
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/books -H "Accept: text/plain"</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/books"</span>, produces = <span style="color: #00ff00;">"text/plain"</span>)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">String</span> <span style="color: #0000ff; font-weight: bold;">getBooksText</span>() {
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">"Mastering Spring MVC,Spring in Action"</span>;
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/books</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/books"</span>)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">List</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #0000ff; font-weight: bold;">getBooks</span>() {
    <span style="color: #00ffff; font-weight: bold;">return</span> Arrays.asList(<span style="color: #00ff00;">"Mastering Spring MVC"</span>, <span style="color: #00ff00;">"Spring in Action"</span>);
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl -X PUT dev:8180/api/profile -d '{"name": "zzyong", "phone": 12345678901}' -H "Content-Type: application/octet-stream"</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/profile"</span>, method = <span style="color: #ff00ff;">RequestMethod</span>.PUT,
                  consumes = <span style="color: #00ff00;">"application/octet-stream"</span>)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">submitProfile</span>(<span style="color: #00ff00;">HttpServletRequest</span> <span style="color: #ffff00;">request</span>, <span style="color: #00ff00;">HttpServletResponse</span> <span style="color: #ffff00;">response</span>)
    <span style="color: #00ffff; font-weight: bold;">throws</span> <span style="color: #00ff00;">IOException</span> {
    <span style="color: #00ff00;">InputStream</span> <span style="color: #ffff00;">input</span> = request.getInputStream();
    <span style="color: #00ff00;">OutputStream</span> <span style="color: #ffff00;">output</span> = response.getOutputStream();

    <span style="color: #00ff00;">byte</span>[] <span style="color: #ffff00;">buffer</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">byte</span>[512];
    <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">n</span>;
    <span style="color: #00ffff; font-weight: bold;">while</span> ((n = input.read(buffer)) &gt; 0) {
      output.write(buffer, 0, n);
    }
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl -X PUT dev:8180/api/profile -d '{"name": "zzyong", "phone": 12345678901}' -H "Content-Type: application/json"  </span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/profile"</span>, method = <span style="color: #ff00ff;">RequestMethod</span>.PUT, consumes = <span style="color: #00ff00;">"application/json"</span>)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">String</span> <span style="color: #0000ff; font-weight: bold;">submitProfileJson</span>(<span style="color: #ff00ff;">@RequestBody</span> <span style="color: #00ff00;">String</span> <span style="color: #ffff00;">json</span>) {
    <span style="color: #00ffff; font-weight: bold;">return</span> json;
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl -X PUT "dev:8180/api/profile" -d 'name=zzyong&amp;phone=12345678901&amp;favoriteColor=red,green' -vv</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">Content-Type: application/x-www-form-urlencoded</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl -X PUT "dev:8180/api/profile" -F 'name=zzyong' -F 'phone=12345678901' -F 'favoriteColor=red,green' -vv</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">Content-Type: multipart/form-data; boundary=------------------------c00a4e11cd9e4e67</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/profile"</span>, method= <span style="color: #ff00ff;">RequestMethod</span>.PUT)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">ResponseEntity</span> <span style="color: #0000ff; font-weight: bold;">submitProfileForm</span>(<span style="color: #ff00ff;">@Valid</span> <span style="color: #00ff00;">Profile</span> <span style="color: #ffff00;">profile</span>, <span style="color: #00ff00;">BindingResult</span> <span style="color: #ffff00;">bindingResult</span>) {
    <span style="color: #00ffff; font-weight: bold;">if</span> (bindingResult.hasErrors()) {
      <span style="color: #00ff00;">Map</span>&lt;<span style="color: #00ff00;">String</span>, <span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">map</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">HashMap</span>&lt;&gt;();
      <span style="color: #00ffff; font-weight: bold;">for</span>(<span style="color: #00ff00;">FieldError</span> <span style="color: #ffff00;">error</span> : bindingResult.getFieldErrors()){
        map.put(error.getField(), error.getDefaultMessage());
      }
      <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">ResponseEntity</span>&lt;<span style="color: #00ff00;">Map</span>&gt;(map, <span style="color: #ff00ff;">HttpStatus</span>.BAD_REQUEST);      
    } <span style="color: #00ffff; font-weight: bold;">else</span> {
      <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">ResponseEntity</span>&lt;<span style="color: #00ff00;">Profile</span>&gt;(profile, <span style="color: #ff00ff;">HttpStatus</span>.OK);
    }
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl "dev:8180/api/profile" -H "user: bob" -H "password: secret" -vv</span>
  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl "dev:8180/api/profile" -H "Cookie: uid=btxaergfe" -vv</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/profile"</span>, method = <span style="color: #ff00ff;">RequestMethod</span>.GET)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">Profile</span> <span style="color: #0000ff; font-weight: bold;">getProfile</span>(
    <span style="color: #ff00ff;">@CookieValue</span>(<span style="color: #00ff00;">"uid"</span>) <span style="color: #00ff00;">Optional</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">uid</span>,
    <span style="color: #ff00ff;">@RequestHeader</span>(<span style="color: #00ff00;">"user"</span>) <span style="color: #00ff00;">Optional</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">user</span>,
    <span style="color: #ff00ff;">@RequestHeader</span>(<span style="color: #00ff00;">"password"</span>) <span style="color: #00ff00;">Optional</span>&lt;<span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">pass</span>) {
    <span style="color: #00ff00;">Profile</span> <span style="color: #ffff00;">profile</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">Profile</span>();
    profile.name = <span style="color: #00ff00;">"bob"</span>;
    <span style="color: #00ffff; font-weight: bold;">if</span> (uid.isPresent() || (user.isPresent() &amp;&amp; pass.isPresent())) {
      profile.phone = <span style="color: #00ff00;">"31415926535"</span>;
      <span style="color: #00ffff; font-weight: bold;">return</span> profile;
    } <span style="color: #00ffff; font-weight: bold;">else</span> {
      <span style="color: #00ffff; font-weight: bold;">return</span> profile;
    }
  }

  <span style="color: #ffff00;">// </span><span style="color: #ffff00;">curl dev:8180/api/x/100;name=apple;color=red/y/200;name=orange</span>
  <span style="color: #ff00ff;">@RequestMapping</span>(value = <span style="color: #00ff00;">"/x/{x}/y/{y}"</span>)
  <span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">Map</span> <span style="color: #0000ff; font-weight: bold;">coordinateProfile</span>(
    <span style="color: #ff00ff;">@PathVariable</span> <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">x</span>, <span style="color: #ff00ff;">@MatrixVariable</span>(pathVar = <span style="color: #00ff00;">"x"</span>) <span style="color: #00ff00;">Map</span>&lt;<span style="color: #00ff00;">String</span>, <span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">xCnf</span>,
    <span style="color: #ff00ff;">@PathVariable</span> <span style="color: #00ff00;">int</span> <span style="color: #ffff00;">y</span>, <span style="color: #ff00ff;">@MatrixVariable</span>(pathVar = <span style="color: #00ff00;">"y"</span>) <span style="color: #00ff00;">Map</span>&lt;<span style="color: #00ff00;">String</span>, <span style="color: #00ff00;">String</span>&gt; <span style="color: #ffff00;">yCnf</span>) {
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">HashMap</span>&lt;<span style="color: #00ff00;">Integer</span>, <span style="color: #00ff00;">Map</span>&gt;() {{
      put(x, xCnf);
      put(y, yCnf);
    }};
  }
}
</pre>
</div>
</div>
