blogsrc/spring-howto.org
*** RestController
通过RestController标注， ~EchoController~ 中相应的函数会成为相应url的处理函数。

*** RequestMapping
当RequestMapping用来标类时，相应的path成为该类中，所有url的前缀，本例中所有url都自动加 /api 前缀。
RequestMapping 常用参数如下：
- value 指定url，可以指定多个，如 ~getPower~ 和 ~getUpper~
- method 指定 HTTP 方法，默认不限制
- produces 指定 Accept，只有Accept符合的请求才接受
- consumes 指定 Content-Type，只有Content-Type符合的请求才接受

当同一个url可以产生多种格式的输出时，请求通过 ~Accept~ 头指定接受的格式，选择匹配的 ~produces~ 处理函数，产生相应输出。

例如，指定 ~Accept~ 只接受文本格式时，/api/books 返回逗号分隔的字符串，默认返回json。
#+BEGIN_SRC sh
$ curl dev:8180/api/books -H "Accept: text/plain"
Mastering Spring MVC,Spring in Action

$ curl dev:8180/api/books
["Mastering Spring MVC","Spring in Action"]
#+END_SRC

当同一个url接受多种格式的输入时，请求通过 ~Content-Type~ 指定输入的格式，选择匹配的 ~consumes~ 处理函数。

例如，指定 ~Content-Type~ 为 application/json 时，可以输入原生的Json数据，而不指定可以接受任意类型。这个主要影响数据绑定，Spring支持Content-Type为 application/x-www-form-urlencoded 和 multipart/form-data 的绑定

#+BEGIN_SRC sh
$ curl -X PUT dev:8180/api/profile -d '{"name": "zzyong", "phone": 12345678901}' -H "Content-Type: application/json"
{"name": "zzyong", "phone": 12345678901}

$ curl -X PUT dev:8180/api/profile -d 'name=zzyong&phone=12345678901&favoriteColor=red,green'
{"name":"zzyong","phone":"12345678901","favoriteColor":["red","green"]}
#+END_SRC

*** PathVariable
~PathVariable~ 用于绑定url模板中的参数，它只有一个参数，用于指定变量在url模板的名字。

在 ~getPower~ 中，url模板为 {"/power/{base}", "/power/{base}/{power}"}，变量base的名字和{base}相同，而变量powerOpt和{power}不同，所以使用 ~@PathVariable("power")~ 指定模板的名字。

此外， ~RequestMapping~ 指定了两个url，power是可选的，此时可以使用Java8的新特性，Optional。虽然Java8提供了 OptionLong 作为 Optional<Long> 的优化，似乎目前spring并不支持前者。

*** ReqestParam
~RequestParam~ 用于绑定 ~querystring~ 和 ~requestbody~ 中的参数，其主要参数有
- required 指定参数是否必须，默认为ture
- defaultValue 当required为false时，指定默认值，必须是字符串串，和绑定变量的类型无关。例如 1 写成 "1"

*** CookieValue 和 RequestHeader
~CooieValue~ 用于绑定 ~Cookie~ 中的某一个， ~RequestHeader~ 用于绑定header
在 getProfile 中，用了Optional，因为这些都是可选的。

*** MatrixVariable
~MatrixVariable~ 用于获取url的某段path的选项，默认是关闭的，需要通过一个配置打开，具体来说就是创建一个 ~Bean~ 。
#+BEGIN_SRC java
@Bean
public RequestMappingHandlerMapping requestMappingHandlerMapping() {
  RequestMappingHandlerMapping r = new RequestMappingHandlerMapping();
  r.setRemoveSemicolonContent(false);
  return r;
}
#+END_SRC

~MatrixVariable~ 主要参数是一个 ~pathVar~ 用于指定相应的url模板部分，如果不指定，全部的matrix都会放到一个 ~Map~ 中去。

~MatrixVariable~ 只是请求url有所不同，并不影响 ~RequestMapping~ 的形式。例如 x/{x}/y/{y} 可以映射下面的请求

#+BEGIN_SRC sh
$ curl 'http://dev:8180/api/x/100;name=apple;color=red/y/200;name=orange'
{"100":{"name":["apple"],"color":["red"]},"200":{"name":["orange"]}}
#+END_SRC


*** RequestBody
对于 ~Content-Type~ 为 ~application/x-www-form-urlencoded~ 和 ~multipart/form-data~ 的请求，通常会把 ~requestbody~ 以key-value的形式绑定到各个变量。但有时需要获取整个 ~requestbody~ 的内容，此时可以用 ~RequestBody~ ，如 ~submitProfileJson~ 所示。

*** 绑定到对象
~submitProfileForm~ 的参数是 ~(@Valid Profile profile, BindingResult bindingResult)~ ，spring会把 ~querystring~ 和 ~requestbody~ 中的值绑定到 ~Profile~ 。假如 ~requestbody~ 是 ~name=zzyong&phone=12345678901&favoriteColor=red,green~ ，spring解析到name时，会调用Profile的 ~setName~ 函数，解析到favoriteColor时，会调用 ~setFavoriteColor~ 。注意 Profile中的相关字段，必须有set方法，仅仅是public时不够的。

除了基本的类型转换，String转long外， *逗号分隔* 的字符串，也会被转成List。

*** 参数校验
使用场景参考 ~Profile~ 和 ~submitProfileForm~ ，可选的校验类型与spring无关，常见的校验
- DateTimeFormat @DateTimeFormat(pattern = "yyyy-MM-dd'T'HH:mm:ss")
- Pattern @Pattern(regexp = "\\d{11,15}")
- NotBlank
- NotNull
- Min Max
- Size

Valid 用于校验参数的合法性，并把校验结果存放到 ~BindingResult~ 中。 例如：
#+BEGIN_SRC sh
$ curl -X PUT "dev:8180/api/profile" -d 'phone=12345678901&favoriteColor=red,green'
{"name":"name is required"}
#+END_SRC

*** 原生态的输入
如果上述绑定满足不了需求，仍然可以获得类似 ~Servlet~ 的参数，如 ~submitProfileStream~ 所示。

*** Spring 对 RestController 中函数原型的要求
有过 ~Servlet~ 编程经验的人，初次看到 ~RestController~ 的代码，可能会惊讶于函数签名的千奇百怪。的确，很多框架，都是要求使用者继承一个类，覆盖一些方法，或者实现一些接口，函数原型并没有选择的余地。Spring不是这样， ~RestController~ 中的函数原型是任意的，Spring会根据注解和变量类型，做正确的函数调用。

** Spring 对输出的抽象

*** 返回String
*** 返回对象
