blogs/spring-howto.html

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> RestController</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
通过RestController标注， <code>EchoController</code> 中相应的函数会成为相应url的处理函数。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> RequestMapping</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
当RequestMapping用来标类时，相应的path成为该类中，所有url的前缀，本例中所有url都自动加 /api 前缀。
RequestMapping 常用参数如下：
</p>
<ul class="org-ul">
<li>value 指定url，可以指定多个，如 <code>getPower</code> 和 <code>getUpper</code>
</li>
<li>method 指定 HTTP 方法，默认不限制
</li>
<li>produces 指定 Accept，只有Accept符合的请求才接受
</li>
<li>consumes 指定 Content-Type，只有Content-Type符合的请求才接受
</li>
</ul>

<p>
当同一个url可以产生多种格式的输出时，请求通过 <code>Accept</code> 头指定接受的格式，选择匹配的 <code>produces</code> 处理函数，产生相应输出。
</p>

<p>
例如，指定 <code>Accept</code> 只接受文本格式时，/api/books 返回逗号分隔的字符串，默认返回json。
</p>
<div class="org-src-container">

<pre class="src src-sh">$ curl dev:8180/api/books -H <span style="color: #00ff00;">"Accept: text/plain"</span>
Mastering Spring MVC,Spring<span style="color: #00ffff; font-weight: bold;"> in</span> Action

$ curl dev:8180/api/books
[<span style="color: #00ff00;">"Mastering Spring MVC"</span>,<span style="color: #00ff00;">"Spring in Action"</span>]
</pre>
</div>

<p>
当同一个url接受多种格式的输入时，请求通过 <code>Content-Type</code> 指定输入的格式，选择匹配的 <code>consumes</code> 处理函数。
</p>

<p>
例如，指定 <code>Content-Type</code> 为 application/json 时，可以输入原生的Json数据，而不指定可以接受任意类型。这个主要影响数据绑定，Spring支持Content-Type为 application/x-www-form-urlencoded 和 multipart/form-data 的绑定
</p>

<div class="org-src-container">

<pre class="src src-sh">$ curl -X PUT dev:8180/api/profile -d <span style="color: #00ff00;">'{"name": "zzyong", "phone": 12345678901}'</span> -H <span style="color: #00ff00;">"Content-Type: application/json"</span>
{<span style="color: #00ff00;">"name"</span>: <span style="color: #00ff00;">"zzyong"</span>, <span style="color: #00ff00;">"phone"</span>: 12345678901}

$ curl -X PUT dev:8180/api/profile -d <span style="color: #00ff00;">'name=zzyong&amp;phone=12345678901&amp;favoriteColor=red,green'</span>
{<span style="color: #00ff00;">"name"</span>:<span style="color: #00ff00;">"zzyong"</span>,<span style="color: #00ff00;">"phone"</span>:<span style="color: #00ff00;">"12345678901"</span>,<span style="color: #00ff00;">"favoriteColor"</span>:[<span style="color: #00ff00;">"red"</span>,<span style="color: #00ff00;">"green"</span>]}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> PathVariable</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
<code>PathVariable</code> 用于绑定url模板中的参数，它只有一个参数，用于指定变量在url模板的名字。
</p>

<p>
在 <code>getPower</code> 中，url模板为 {"/power/{base}", "/power/{base}/{power}"}，变量base的名字和{base}相同，而变量powerOpt和{power}不同，所以使用 <code>@PathVariable("power")</code> 指定模板的名字。
</p>

<p>
此外， <code>RequestMapping</code> 指定了两个url，power是可选的，此时可以使用Java8的新特性，Optional。虽然Java8提供了 OptionLong 作为 Optional&lt;Long&gt; 的优化，似乎目前spring并不支持前者。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> ReqestParam</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
<code>RequestParam</code> 用于绑定 <code>querystring</code> 和 <code>requestbody</code> 中的参数，其主要参数有
</p>
<ul class="org-ul">
<li>required 指定参数是否必须，默认为ture
</li>
<li>defaultValue 当required为false时，指定默认值，必须是字符串串，和绑定变量的类型无关。例如 1 写成 "1"
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> CookieValue 和 RequestHeader</h4>
<div class="outline-text-4" id="text-3-2-5">
<p>
<code>CooieValue</code> 用于绑定 <code>Cookie</code> 中的某一个， <code>RequestHeader</code> 用于绑定header
在 getProfile 中，用了Optional，因为这些都是可选的。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> MatrixVariable</h4>
<div class="outline-text-4" id="text-3-2-6">
<p>
<code>MatrixVariable</code> 用于获取url的某段path的选项，默认是关闭的，需要通过一个配置打开，具体来说就是创建一个 <code>Bean</code> 。
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #ff00ff;">@Bean</span>
<span style="color: #00ffff; font-weight: bold;">public</span> <span style="color: #00ff00;">RequestMappingHandlerMapping</span> <span style="color: #0000ff; font-weight: bold;">requestMappingHandlerMapping</span>() {
  <span style="color: #00ff00;">RequestMappingHandlerMapping</span> <span style="color: #ffff00;">r</span> = <span style="color: #00ffff; font-weight: bold;">new</span> <span style="color: #00ff00;">RequestMappingHandlerMapping</span>();
  r.setRemoveSemicolonContent(<span style="color: #ff00ff;">false</span>);
  <span style="color: #00ffff; font-weight: bold;">return</span> r;
}
</pre>
</div>

<p>
<code>MatrixVariable</code> 主要参数是一个 <code>pathVar</code> 用于指定相应的url模板部分，如果不指定，全部的matrix都会放到一个 <code>Map</code> 中去。
</p>

<p>
<code>MatrixVariable</code> 只是请求url有所不同，并不影响 <code>RequestMapping</code> 的形式。例如 x/{x}/y/{y} 可以映射下面的请求
</p>

<div class="org-src-container">

<pre class="src src-sh">$ curl <span style="color: #00ff00;">'http://dev:8180/api/x/100;name=apple;color=red/y/200;name=orange'</span>
{<span style="color: #00ff00;">"100"</span>:{<span style="color: #00ff00;">"name"</span>:[<span style="color: #00ff00;">"apple"</span>],<span style="color: #00ff00;">"color"</span>:[<span style="color: #00ff00;">"red"</span>]},<span style="color: #00ff00;">"200"</span>:{<span style="color: #00ff00;">"name"</span>:[<span style="color: #00ff00;">"orange"</span>]}}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3-2-7" class="outline-4">
<h4 id="sec-3-2-7"><span class="section-number-4">3.2.7</span> RequestBody</h4>
<div class="outline-text-4" id="text-3-2-7">
<p>
对于 <code>Content-Type</code> 为 <code>application/x-www-form-urlencoded</code> 和 <code>multipart/form-data</code> 的请求，通常会把 <code>requestbody</code> 以key-value的形式绑定到各个变量。但有时需要获取整个 <code>requestbody</code> 的内容，此时可以用 <code>RequestBody</code> ，如 <code>submitProfileJson</code> 所示。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-8" class="outline-4">
<h4 id="sec-3-2-8"><span class="section-number-4">3.2.8</span> 绑定到对象</h4>
<div class="outline-text-4" id="text-3-2-8">
<p>
<code>submitProfileForm</code> 的参数是 <code>(@Valid Profile profile, BindingResult bindingResult)</code> ，spring会把 <code>querystring</code> 和 <code>requestbody</code> 中的值绑定到 <code>Profile</code> 。假如 <code>requestbody</code> 是 <code>name=zzyong&amp;phone=12345678901&amp;favoriteColor=red,green</code> ，spring解析到name时，会调用Profile的 <code>setName</code> 函数，解析到favoriteColor时，会调用 <code>setFavoriteColor</code> 。注意 Profile中的相关字段，必须有set方法，仅仅是public时不够的。
</p>

<p>
除了基本的类型转换，String转long外， <b>逗号分隔</b> 的字符串，也会被转成List。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-9" class="outline-4">
<h4 id="sec-3-2-9"><span class="section-number-4">3.2.9</span> 参数校验</h4>
<div class="outline-text-4" id="text-3-2-9">
<p>
使用场景参考 <code>Profile</code> 和 <code>submitProfileForm</code> ，可选的校验类型与spring无关，常见的校验
</p>
<ul class="org-ul">
<li>DateTimeFormat @DateTimeFormat(pattern = "yyyy-MM-dd'T'HH:mm:ss")
</li>
<li>Pattern @Pattern(regexp = "\\d{11,15}")
</li>
<li>NotBlank
</li>
<li>NotNull
</li>
<li>Min Max
</li>
<li>Size
</li>
</ul>

<p>
Valid 用于校验参数的合法性，并把校验结果存放到 <code>BindingResult</code> 中。 例如：
</p>
<div class="org-src-container">

<pre class="src src-sh">$ curl -X PUT <span style="color: #00ff00;">"dev:8180/api/profile"</span> -d <span style="color: #00ff00;">'phone=12345678901&amp;favoriteColor=red,green'</span>
{<span style="color: #00ff00;">"name"</span>:<span style="color: #00ff00;">"name is required"</span>}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-10" class="outline-4">
<h4 id="sec-3-2-10"><span class="section-number-4">3.2.10</span> 原生态的输入</h4>
<div class="outline-text-4" id="text-3-2-10">
<p>
如果上述绑定满足不了需求，仍然可以获得类似 <code>Servlet</code> 的参数，如 <code>submitProfileStream</code> 所示。
</p>
</div>
</div>

<div id="outline-container-sec-3-2-11" class="outline-4">
<h4 id="sec-3-2-11"><span class="section-number-4">3.2.11</span> Spring 对 RestController 中函数原型的要求</h4>
<div class="outline-text-4" id="text-3-2-11">
<p>
有过 <code>Servlet</code> 编程经验的人，初次看到 <code>RestController</code> 的代码，可能会惊讶于函数签名的千奇百怪。的确，很多框架，都是要求使用者继承一个类，覆盖一些方法，或者实现一些接口，函数原型并没有选择的余地。Spring不是这样， <code>RestController</code> 中的函数原型是任意的，Spring会根据注解和变量类型，做正确的函数调用。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Spring 对输出的抽象</h3>
<div class="outline-text-3" id="text-3-3">
</div><div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> 返回String</h4>
</div>
<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> 返回对象</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-01-20 三 19:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
